content/past.org
#+title: Anand Deopurkar: Archived "now" items
#+description: Archived now items from Anand Deopurkar's webpage
#+LINK: wiki  https://en.wikipedia.org/wiki/

* 2025
** 2025-06 June
*** 2025-06-06 Friday
**** I am supervising Charlie Sherrat, who has been exploring the moduli space of [[wiki:Cubic_surface][cubic surfaces]] arising from 3x3x4 rubik's cubes.
:PROPERTIES:
:ARCHIVE_TIME: 2025-06-06 Fri 09:55
:ARCHIVE_FILE: ~/website/content/index.org
:ARCHIVE_OLPATH: now
:ARCHIVE_CATEGORY: index
:END:
**** I am supervising Luke Doherty, who is looking into the geometry of [[wiki:Linkage_(mechanical)][linkages]].
:PROPERTIES:
:ARCHIVE_TIME: 2025-06-06 Fri 09:55
:ARCHIVE_FILE: ~/website/content/index.org
:ARCHIVE_OLPATH: now
:ARCHIVE_CATEGORY: index
:END:
**** This semester, I am teaching Algebra 2 (Fields and Galois theory).
:PROPERTIES:
:ARCHIVE_TIME: 2025-06-06 Fri 09:55
:ARCHIVE_FILE: ~/website/content/index.org
:ARCHIVE_OLPATH: now
:ARCHIVE_CATEGORY: index
:END:
  
