docs/past.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-06 Fri 10:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Anand Deopurkar: Archived "now" items</title>
<meta name="author" content="Anand Deopurkar" />
<meta name="description" content="Archived now items from Anand Deopurkar's webpage" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css"><link href="https://fonts.googleapis.com/css2?family=Atkinson+Hyperlegible:ital,wght@0,400;0,700;1,400;1,700&family=B612:wght@300..700&display=swap" rel="stylesheet"></head>
<body>
<div id="content" class="content">
<h1 class="title">Anand Deopurkar: Archived &ldquo;now&rdquo; items</h1>
<div id="outline-container-org4c68b90" class="outline-2">
<h2 id="org4c68b90">2025</h2>
<div class="outline-text-2" id="text-org4c68b90">
</div>
<div id="outline-container-orgffc054c" class="outline-3">
<h3 id="orgffc054c">2025-06 June</h3>
<div class="outline-text-3" id="text-orgffc054c">
</div>
<div id="outline-container-orgc30e3b8" class="outline-4">
<h4 id="orgc30e3b8">2025-06-06 Friday</h4>
<div class="outline-text-4" id="text-orgc30e3b8">
</div>
<ul class="org-ul">
<li><a id="org208e8f9"></a>I am supervising Charlie Sherrat, who has been exploring the moduli space of <a href="https://en.wikipedia.org/wiki/Cubic_surface">cubic surfaces</a> arising from 3x3x4 rubik&rsquo;s cubes.<br />
<div class="outline-text-5" id="text-org208e8f9">
</div>
</li>
<li><a id="orgede95ce"></a>I am supervising Luke Doherty, who is looking into the geometry of <a href="https://en.wikipedia.org/wiki/Linkage_(mechanical)">linkages</a>.<br />
<div class="outline-text-5" id="text-orgede95ce">
</div>
</li>
<li><a id="org20661e3"></a>This semester, I am teaching Algebra 2 (Fields and Galois theory).<br />
<div class="outline-text-5" id="text-org20661e3">
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).  Last modified: 2025-06-06 Fri 10:09.  <a href="https://github.com/deopurkar/deopurkar.github.io">Source</a>
</div>
</body>
</html>
